Changed all raw diagrams to mermiad
